/////////////////////////////////////////////////////////////////////////////
//	マップの処理 (redrocketField.h)
//	Author : TAKUMI UENO
////////////////////////////////////////////////////////////////////////////
#ifndef REDROCKET_H
#define REDROCKET_H

//--------------------------------------------------------------------------
//	構造体定義
//--------------------------------------------------------------------------
typedef struct
{
	int startX;
	int startY;

	int endX;
	int endY;
	
	int type;

	int posX;
	int posY;
}ROCKET;

//--------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------
void drawBackground ( int type, int startX, int endX, int startY, int endY, int posX, int posY );

#endif